todos/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "whatevs"], ["body", "yours"], ["created_at", "2018-10-03 00:21:58.475856"], ["updated_at", "2018-10-03 00:21:58.475856"]]
---
  def create
    @todo = Todo.new(todoparams)

    if @todo.save!

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "done" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["body", "your mother, sir"], ["done", true], ["updated_at", "2018-10-03 00:26:08.986405"], ["id", 7]]
---
  def update
    @todo = Todo.find(params[:id])
    if @todo.update_attributes(todoparams)